#include <stdio.h> // ประกาศฟังก์ชันมาตรฐาน

int main(){                             // ฟังก์ชันหลัก
    int x, y;                           // ประกาศตัวแปรเก็บจำนวนเต็ม x และ y
    scanf("%d %d", &x, &y);             // รับค่าจำนวนเต็มจากผู้ใช้และเก็บในตัวแปร x และ y
    printf("x = %d, y = %d\n", x, y);   // แสดงผลค่าของ x และ y

    if (x>y){                           // ตรวจสอบเงื่อนไขว่าค่า x มากกว่า y หรือไม่
        printf("x>y = %d>%d\n",x,y);    // ถ้าเงื่อนไขเป็นจริง แสดงผลข้อความว่า x มากกว่า y
    }else if (x<y){                     // ถ้าเงื่อนไขแรกเป็นเท็จ ตรวจสอบเงื่อนไขว่าค่า x น้อยกว่า y หรือไม่
        printf("x<y = %d<%d\n",x,y);    // ถ้าเงื่อนไขเป็นจริง แสดงผลข้อความว่า x น้อยกว่า y
    }else{                              // ถ้าเงื่อนไขก่อนหน้าเป็นเท็จ
        printf("x=y = %d=%d\n",x,y);    // ให้ทำงานในส่วนนี้ แสดงผลข้อความว่า x เท่ากับ y
    }
    printf("End of program\n");         // แสดงผลข้อความสิ้นสุดโปรแกรม

    return 0;                           // คืนค่า 0 เพื่อบอกว่าการทำงานสำเร็จ
}